<details><summary>Digger run report at 2024-04-01 08:10:41 (UTC)</summary>
    <details><summary>Additional output for <b>develeap/iac-terragrunt-template#infrastructure-live_01234567890_prod_prod-1_il-central-1_compute_demo-ec2</b></summary>
  
```terraform
Project: develeap/iac-terragrunt-template/infrastructure-live/01234567890/prod/prod-1/il-central-1/compute/demo-ec2

 Name                                                 Monthly Qty  Unit   Monthly Cost 
                                                                                       
 aws_instance.this[0]                                                                  
 ├─ Instance usage (Linux/UNIX, on-demand, t3.micro)          730  hours         $8.76 
 └─ root_block_device                                                                  
    └─ Storage (general purpose SSD, gp2)                       8  GB            $1.06 
                                                                                       
 OVERALL TOTAL                                                                   $9.82 
──────────────────────────────────
1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━┓
┃ Project                                                          ┃ Monthly cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━┫
┃ develeap/iac-terragrunt-templat.../il-central-1/compute/demo-ec2 ┃ $10          ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━┛
──────────────────────────────────

1 cloud resource was detected:
∙ 1 was estimated, it includes usage-based costs, see https://infracost.io/usage-file

  ```
</details>

<details><summary>Plan for <b>develeap/iac-terragrunt-template#infrastructure-live_01234567890_prod_prod-1_il-central-1_compute_demo-ec2</b></summary>
  
```terraform
Terraform will perform the following actions:

  # aws_instance.this[0] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-0fbd08534ff5a05ff"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = (known after apply)
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-075ffae68d9b0487a"
      + tags                                 = {
          + "Name" = "prod.demo.ec2"
        }
      + tags_all                             = {
          + "AccountId"   = "006262944085"
          + "AccountName" = "lior.dux"
          + "Environment" = "prod"
          + "Name"        = "prod.demo.ec2"
          + "Objective"   = "Digger with Terragrunt"
          + "Owner"       = "Lior Dux"
          + "Region"      = "il-central-1"
          + "Terragrunt"  = "True"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + volume_tags                          = {
          + "Name" = "prod.demo.ec2"
        }
      + vpc_security_group_ids               = [
          + "sg-03a28927b740df64e",
        ]

      + credit_specification {}

      + enclave_options {
          + enabled = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 1
          + http_tokens                 = "optional"
          + instance_metadata_tags      = (known after apply)
        }

      + timeouts {}
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + ami                                = "ami-0fbd08534ff5a05ff"
  + arn                                = (known after apply)
  + availability_zone                  = (known after apply)
  + capacity_reservation_specification = (known after apply)
  + ebs_block_device                   = (known after apply)
  + ephemeral_block_device             = (known after apply)
  + id                                 = (known after apply)
  + instance_state                     = (known after apply)
  + ipv6_addresses                     = (known after apply)
  + outpost_arn                        = (known after apply)
  + password_data                      = (known after apply)
  + primary_network_interface_id       = (known after apply)
  + private_dns                        = (known after apply)
  + private_ip                         = (known after apply)
  + public_dns                         = (known after apply)
  + public_ip                          = (known after apply)
  + root_block_device                  = (known after apply)
  + tags_all                           = {
      + AccountId   = "006262944085"
      + AccountName = "lior.dux"
      + Environment = "prod"
      + Name        = "prod.demo.ec2"
      + Objective   = "Digger with Terragrunt"
      + Owner       = "Lior Dux"
      + Region      = "il-central-1"
      + Terragrunt  = "True"
    }

	nnununununununununununununununununununununununununununununununnununununununununununununununununununununununununununununununnunununununununununununununununununununu
 	===================================================================Finished Running Terrafom=======================================================================
 	unununununununununununununununununununununununununununununununnununununununununununununununununununununununununununununununnunununununununununununununununununununu


  ```
</details>

</details>